#include <stdio.h>

int main()
{
    int N, i;

    // N এর মান ইনপুট নেওয়া হচ্ছে
    scanf("%d", &N);

    // ১ থেকে N পর্যন্ত একটিমাত্র লুপ চালানো হচ্ছে
    for (i = 1; i <= N; i++)
    {

        // প্রথমে ৩ এবং ৪ উভয় দিয়ে বিভাজ্যের শর্ত চেক করতে হবে
        if (i % 3 == 0 && i % 4 == 0)
        {
            printf("DIU-CSE\n");
        }
        // শুধু ৩ দ্বারা বিভাজ্য কিনা
        else if (i % 3 == 0)
        {
            printf("DIU\n");
        }
        // শুধু ৪ দ্বারা বিভাজ্য কিনা
        else if (i % 4 == 0)
        {
            printf("CSE\n");
        }
        // কোনোটি দিয়েই না গেলে সংখ্যা নিজেই প্রিন্ট হবে
        else
        {
            printf("%d\n", i);
        }
    }

    return 0;
}